//=============================================================================
//
// ゲーム処理 [game.cpp]
// Author : GP11B243 24 人見友基
//
//=============================================================================
#include "game.h"
#include "stage.h"
#include "input.h"
#include "fade.h"

// ゲームで必要なインクルード

// 担当ワーク
#include "workChisaka.h"
#include "workHitomi.h"
#include "workHoriguchi.h"
#include "workYamaguchi.h"
#include "workYoshida.h"

// デバッグ用
#ifdef _DEBUG
#include "debugproc.h"
#endif

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************

//*****************************************************************************
// グローバル変数
//*****************************************************************************


//=============================================================================
// 初期化処理
//=============================================================================
HRESULT InitGame(int nType)
{

	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void UninitGame(void)
{

}

//=============================================================================
// 更新処理
//=============================================================================
void UpdateGame(void)
{
	UpdateWorkChisaka();		// 千坂担当分
	UpdateWorkHitomi();			// 人見担当分
	UpdateWorkHoriguchi();		// 堀口担当分
	UpdateWorkYamaguchi();		// 山口担当分
	UpdateWorkYoshida();		// 吉田担当分

	// エンターキーでステージ遷移（テスト）
	if (GetKeyboardPress(DIK_RETURN))
	{
		SetFade(FADE_OUT, STAGE_RESULT);
	}
}

//=============================================================================
// 描画処理
//=============================================================================
void DrawGame(void)
{
	DrawWorkChisaka();			// 千坂担当分
	DrawWorkHitomi();			// 人見担当分
	DrawWorkHoriguchi();		// 堀口担当分
	DrawWorkYamaguchi();		// 山口担当分
	DrawWorkYoshida();			// 吉田担当分
}

