//=============================================================================
//
// リザルト処理 [result.cpp]
// Author : GP11B243 24 人見友基
//
//=============================================================================
#include "result.h"
#include "stage.h"
#include "input.h"
#include "fade.h"

// リザルトで必要なインクルード

// 担当ワーク
#include "workChisaka.h"
#include "workHitomi.h"
#include "workHoriguchi.h"
#include "workYamaguchi.h"
#include "workYoshida.h"

// デバッグ用
#ifdef _DEBUG
#include "debugproc.h"
#endif

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************

//*****************************************************************************
// グローバル変数
//*****************************************************************************


//=============================================================================
// 初期化処理
//=============================================================================
HRESULT InitResult(int nType)
{

	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void UninitResult(void)
{

}

//=============================================================================
// 更新処理
//=============================================================================
void UpdateResult(void)
{
	UpdateWorkChisaka();		// 千坂担当分
	UpdateWorkHitomi();			// 人見担当分
	UpdateWorkHoriguchi();		// 堀口担当分
	UpdateWorkYamaguchi();		// 山口担当分
	UpdateWorkYoshida();		// 吉田担当分
}

//=============================================================================
// 描画処理
//=============================================================================
void DrawResult(void)
{
	DrawWorkChisaka();			// 千坂担当分
	DrawWorkHitomi();			// 人見担当分
	DrawWorkHoriguchi();		// 堀口担当分
	DrawWorkYamaguchi();		// 山口担当分
	DrawWorkYoshida();			// 吉田担当分
}

