//=============================================================================
//
// Stage処理 [stage.h]
// Author : GP11B243 24 人見友基
//
//=============================================================================
#ifndef _STAGE_H_
#define _STAGE_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define START_STAGE		(STAGE_TITLE)	// 開始時のステージ

/*******************************************************************************
* 構造体定義
*******************************************************************************/
typedef struct
{
	int					nTime;
	bool				bClearFlag;
	bool				bEndFlag;
}STAGE_SYS;

/*******************************************************************************
* 列挙型定義
*******************************************************************************/
enum
{	// ステージ
	STAGE_TITLE,
	STAGE_GAME,
	STAGE_RESULT,
	STAGE_MAX
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitStage(HINSTANCE hInstance, HWND hWnd);
void UpdateStage(void);
STAGE_SYS *GetStageSys(void);
void SetResultTime(int nTime);
int GetResultTime(void);
void SetClearFlag(bool bClearFlag);
bool GetClearFlag(void);
bool GetEndFlag(void);

#endif