//=============================================================================
//
// タイトル処理 [title.cpp]
// Author : GP11B243 24 人見友基
//
//=============================================================================
#include "title.h"
#include "stage.h"
#include "input.h"
#include "fade.h"

// タイトルで必要なインクルード

// 担当ワーク
#include "workChisaka.h"
#include "workHitomi.h"
#include "workHoriguchi.h"
#include "workYamaguchi.h"
#include "workYoshida.h"

// デバッグ用
#ifdef _DEBUG
#include "debugproc.h"
#endif

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************

//*****************************************************************************
// グローバル変数
//*****************************************************************************


//=============================================================================
// 初期化処理
//=============================================================================
HRESULT InitTitle(int nType)
{

	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void UninitTitle(void)
{

}

//=============================================================================
// 更新処理
//=============================================================================
void UpdateTitle(void)
{
	UpdateWorkChisaka();		// 千坂担当分
	UpdateWorkHitomi();			// 人見担当分
	UpdateWorkHoriguchi();		// 堀口担当分
	UpdateWorkYamaguchi();		// 山口担当分
	UpdateWorkYoshida();		// 吉田担当分

}

//=============================================================================
// 描画処理
//=============================================================================
void DrawTitle(void)
{
	DrawWorkChisaka();			// 千坂担当分
	DrawWorkHitomi();			// 人見担当分
	DrawWorkHoriguchi();		// 堀口担当分
	DrawWorkYamaguchi();		// 山口担当分
	DrawWorkYoshida();			// 吉田担当分
}

